In [60]:
import pandas as pd
import numpy as np
from numpy import nan as NA
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## Indexação hierárquica
<br>
A indexação hierárquica nos permite ter dois ou mais níveis de indíces em um eixo. Facilitando o trabalho com dados de dimensões mais altas em um formato de dimensões menores.

In [61]:
data = pd.Series(np.random.randn(9), index=[['a','a','a','b','b','c','c','d','d'],
                                            [1,2,3,1,3,1,2,2,3]])
data
print('-----------')
data.index # obtendo as divisões MultiIndex de uma Series

a  1    0.584141
   2    0.075695
   3    0.554655
b  1    1.161167
   3   -0.756147
c  1    0.064726
   2   -1.213634
d  2   -0.075874
   3   -2.188972
dtype: float64

-----------

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [62]:
# fatiando uma indexação hierárquica
data['b']
print('-----------')
data['b':'c']
print('-----------')
data.loc[['b','d']]

1    1.161167
3   -0.756147
dtype: float64

-----------

b  1    1.161167
   3   -0.756147
c  1    0.064726
   2   -1.213634
dtype: float64

-----------

b  1    1.161167
   3   -0.756147
d  2   -0.075874
   3   -2.188972
dtype: float64

In [63]:
# fatiando e selecionando o nível
data.loc[:,2] # todos os níveis externos que tiverem nível interno =  2

a    0.075695
c   -1.213634
d   -0.075874
dtype: float64

In [64]:
# reorganizando os dados em um DataFrame com método unstack
data.unstack()
print('-----------')
data.unstack().stack()

          1         2         3
a  0.584141  0.075695  0.554655
b  1.161167       NaN -0.756147
c  0.064726 -1.213634       NaN
d       NaN -0.075874 -2.188972

-----------

a  1    0.584141
   2    0.075695
   3    0.554655
b  1    1.161167
   3   -0.756147
c  1    0.064726
   2   -1.213634
d  2   -0.075874
   3   -2.188972
dtype: float64

In [65]:
# DataFrames podem ter hieráquia em qualquer eixo
frame = pd.DataFrame(np.arange(12).reshape((4,3)), index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['Ohio','Ohio','Colorado'], ['Green','Red','Green']])
frame
print('----------')
# podemos dar nomes aos níveis hieráquicos de um DataFrame
frame.index.names=['key1','key2']
frame.columns.names=['state','color']
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

----------

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [66]:
# indexação de um DataFrame hierárquico
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [67]:
# podemos criar um MultiIndex de maneira independente
pd.MultiIndex.from_arrays([['Ohio','Ohio','Colorad'],['Green','Red','Green']], names=['state','color'])

MultiIndex([(   'Ohio', 'Green'),
            (   'Ohio',   'Red'),
            ('Colorad', 'Green')],
           names=['state', 'color'])

### Reorganizando e ordenando níveis

In [68]:
# trocando eixos de níveis
frame.swaplevel('key1','key2')
print('-------------------')
# ordenando dados usando os valores de um só indíce
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

-------------------

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [69]:
# trocando eixos de níveis e ordenando-os
frame.swaplevel(0,1).sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

### Estatísticas de reusmo por nível

In [70]:
# Somando os valores de um nível
frame.sum(level='key2')
# Somando os valores de um nível em um eixo específico
print('--------------')
frame.sum(level='color',axis=1)

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

--------------

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Indexando colunas de um DataFrame

In [71]:
frame = pd.DataFrame({'a':range(7),'b':range(7,0,-1), 
                      'c':['one','one','one','two','two','two','two'],
                      'd':[0,1,2,0,1,2,3]})
frame

print('------------------------------')
# usaremos colunas como index
frame2 = frame.set_index(['c','d'])
frame2

# passando valores que são iguais aos das colunas sem tirá-los das colunas
print('------------------------------')
frame.set_index(['c','d'],drop=False)

print('------------------------------')
# passando níveis hierárquicos para colunas
frame2.reset_index()

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

------------------------------

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

------------------------------

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

------------------------------

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Combinando e mesclando conjuntos de dados

pandas.merge(): conecta linha em DataFrames (como joins em SQL).
<br>
pandas.concat(): concatena objetos ao longo de um eixo.
<br>
combine_first(): combina dados que se sobrepõe.

### Junções no DataFrame

In [72]:
# criando os DataFrames
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'], 'data1': range(7)})
df2 = pd.DataFrame({'key':['a','b','d'], 'data2': range(3)})

# output dos DataFrames
df1
print('------------------------------------------------')
df2

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

------------------------------------------------

  key  data2
0   a      0
1   b      1
2   d      2

In [73]:
# método merge()
pd.merge(df1,df2)

# método merge() especificando a coluna para se fazer a junção (boa prática)
pd.merge(df1,df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [74]:
# criando um DataFrame
df3 = pd.DataFrame({'lkey':['b','b','a','c','a','a','b'], 'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a','b','d'],'data2': range(3)})

df3
print('-----------------------------')
df4

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

-----------------------------

  rkey  data2
0    a      0
1    b      1
2    d      2

In [75]:
# método merge() unindo lateralmente
pd.merge(df3, df4, left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [76]:
# método merge() em outer
pd.merge(df1,df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

##### Diferentes tipos de junções com argumento how
<br>
'inner': somente combinações de chaves observadas nas duas tabelas.
<br>
'left': todas as combinações de chaves encontradas na tabela à esquerda.
<br>
'right': todas as combinações de chaves encontradas na tabela à direita
<br>
'outer': todas as combinações de chaves observadas em ambas tabelas em conjunto

In [77]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','b'], 'data1': range(6)})
df2 = pd.DataFrame({'key':['a','b','a','b','d'], 'data2': range(5)})

df1
df2

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [78]:
pd.merge(df1,df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [79]:
pd.merge(df1,df2, on='key', how = 'inner') #intersecção dos DataFrames

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [80]:
# criando DataFrames
left = pd.DataFrame({'key1': ['foo','foo','bar'],'key2':['one','two','one'],'lval':[1,2,3]})
right = pd.DataFrame({'key1': ['foo','foo','bar','bar'],
                      'key2':['one','one','one','two'],
                      'rval':[4,5,6,7]})
left
right

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [81]:
# união dos DataFrame
pd.merge(left, right, on=['key1','key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [82]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [83]:
pd.merge(left, right, on='key1', suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Merge com base no índice

In [84]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})
right1 = pd.DataFrame({'group_val':[3.5,7]}, index=['a','b'])
left1
right1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

   group_val
a        3.5
b        7.0

#### Merge entre index e key
<br>
Explicitamos com os argumentos left_on/right_on e left_index/right_index qual DF está com uma key e qual está indexado normalmente

In [85]:
pd.merge(left1, right1, left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [86]:
pd.merge(left1, right1, left_on='key',right_index=True,how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

#### Merge em hireraquicamente indexados
<br>
Como possuem vários índices, especificamos várias colunas na forma de lista com base nas quais o merge será executado.

In [87]:
lefth = pd.DataFrame({'key1': ['Ohio','Ohio','Ohio','Nevada','Nevada'],
                     'key2': [2000, 2001, 2002, 2001, 2002], 'data':np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6,2)), 
                      index=[['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],
                            [2001, 2000, 2000, 2000, 2001, 2002]],
                     columns=['event1','event2'])

lefth
righth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [88]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [89]:
pd.merge(lefth, righth, left_on=['key1','key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [90]:
left2 = pd.DataFrame([[1.,2.],[3.,4.],[5.,6.]], index=['a','c','e'],columns=['Ohio','Nevada'])
right2 =pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13,14]],
                     index=['b','c','d','e'], 
                     columns=['Missouri','Alabama'])
left2
right2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [91]:
# merge em dois DFs com index declarado
pd.merge(left2,right2, how='outer',left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

Em casos de índices semenlhantes podemos utilizar .join()

In [92]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

### Concatenação ao longo de um eixo

#### Concatenação com numpy

In [93]:
arr = np.arange(12).reshape((3,4))
arr

# concatenando
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

#### Concatenação em pandas

In [94]:
s1 = pd.Series([0,1], index=['a','b'])
s2 = pd.Series([2,3,4], index=['c','d','e'])
s3 = pd.Series([5,6], index=['f','g'])

s1
s2
s3

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [95]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [96]:
pd.concat([s1,s2,s3], axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [97]:
s4 = pd.concat([s1,s3])
s4

# concatenação sobreposta
pd.concat([s1,s4], axis=1)

a    0
b    1
f    5
g    6
dtype: int64

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [98]:
# concatenando intersecção
pd.concat([s1,s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

#### Concatenação e hieraquização

In [99]:
# hierarquizando a concatenação de Series
result = pd.concat([s1,s2,s3],keys = ['one','two','three'])
result

result.unstack()

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [100]:
# hierarquizando a concatenação de DataFrames
df1 = pd.DataFrame(np.arange(6).reshape(3,2))
df2 = pd.DataFrame(5 + np.arange(4).reshape(2,2), index=['a','c'], columns=['three','four'])
df1
df2

pd.concat([df1,df2],axis=1,keys=['level1','level2'])
# passando os níveis para outro eixo
pd.concat({'level1':df1,'level2':df2},axis=0)
# nomenado os níveis
pd.concat([df1,df2],axis=1,keys=['level1','level2'], names=['upper','low'])

   0  1
0  0  1
1  2  3
2  4  5

   three  four
a      5     6
c      7     8

  level1      level2
       0    1  three four
0    0.0  1.0    NaN  NaN
1    2.0  3.0    NaN  NaN
2    4.0  5.0    NaN  NaN
a    NaN  NaN    5.0  6.0
c    NaN  NaN    7.0  8.0

            0    1  four  three
level1 0  0.0  1.0   NaN    NaN
       1  2.0  3.0   NaN    NaN
       2  4.0  5.0   NaN    NaN
level2 a  NaN  NaN   6.0    5.0
       c  NaN  NaN   8.0    7.0

upper level1      level2
low        0    1  three four
0        0.0  1.0    NaN  NaN
1        2.0  3.0    NaN  NaN
2        4.0  5.0    NaN  NaN
a        NaN  NaN    5.0  6.0
c        NaN  NaN    7.0  8.0

#### Concatenação em DFs com índices de linha sem dado relevante

In [101]:
df1 = pd.DataFrame(np.random.rand(3,4), columns=['a','b','c','d'])
df2 = pd.DataFrame(np.random.rand(2,3), columns=['b','d','a'])
df1
df2

          a         b         c         d
0  0.409747  0.780508  0.726345  0.310032
1  0.184407  0.448883  0.399083  0.875878
2  0.442098  0.122458  0.462758  0.022707

          b         d         a
0  0.924348  0.501983  0.787620
1  0.216074  0.049156  0.816092

In [102]:
pd.concat([df1,df2])
pd.concat([df1,df2], ignore_index=True)

          a         b         c         d
0  0.409747  0.780508  0.726345  0.310032
1  0.184407  0.448883  0.399083  0.875878
2  0.442098  0.122458  0.462758  0.022707
0  0.787620  0.924348       NaN  0.501983
1  0.816092  0.216074       NaN  0.049156

          a         b         c         d
0  0.409747  0.780508  0.726345  0.310032
1  0.184407  0.448883  0.399083  0.875878
2  0.442098  0.122458  0.462758  0.022707
3  0.787620  0.924348       NaN  0.501983
4  0.816092  0.216074       NaN  0.049156

### Combinação com sobreposição de índices

In [103]:
a = pd.Series([NA, 2.5, 0.0, 3.5, 4.5, NA], index=['f','e','d','c','b','a'])
b = pd.Series([0., NA, 2., NA, NA, 5.], index=['a','b','c','d','e','f'])
a
b

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [104]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [105]:
#inserindo valores de um DF onde há NAs em outro DF
b.combine_first(a)

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

## Reformatação e pivotamento

### Reformatação com indexação hierárquica
<br>
stack(): pivota as colunas dos dados para as linhas.
<br>
unstacK(): pivotas as linhas de dados para as colunas.

In [106]:
data = pd.DataFrame(np.arange(6).reshape((2,3)), index=pd.Index(['Ohio','Colorado'], name='state'),
                   columns=pd.Index(['one','two','three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [107]:
result = data.stack()

# pivotamento  (padrão desempilhar o nível mais interno)
result
result.unstack()

# desempilhando um nível diferente
result.unstack(0)
result.unstack('state')

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [108]:
s1 = pd.Series([0,1,2,3], index=['a','b','c','d'])
s2 = pd.Series([4,5,6], index=['c','d','e'])
data2 = pd.concat([s1,s2], keys=['one','two'])

data2
data2.unstack()
data2.unstack().stack() #stack dropa NAs por padrão, mudar com o parâmetro dropna

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

Quando desempilhamos dados em um DF, o nível desempilhado torna-se o nível mais baixo no resultado.

In [109]:
df = pd.DataFrame({'left': result, 'right': result+5}, columns=pd.Index(['left','right'],name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [110]:
df.unstack('state')
df.unstack('state').stack('side')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

### Pivotando formato longo para largo

In [111]:
data = pd.read_csv('exemplos/macrodata.csv')
data.head()

periods=pd.PeriodIndex(year=data.year, quarter=data.quarter, name ='date')
columns=pd.Index(['realgdp','infl','unemp'],name='item')
data=data.reindex(columns=columns)
data.index = periods.to_timestamp('D','end')
ldata = data.stack().reset_index().rename(columns = {0:'value'})

ldata

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

                             date     item      value
0   1959-03-31 23:59:59.999999999  realgdp   2710.349
1   1959-03-31 23:59:59.999999999     infl      0.000
2   1959-03-31 23:59:59.999999999    unemp      5.800
3   1959-06-30 23:59:59.999999999  realgdp   2778.801
4   1959-06-30 23:59:59.999999999     infl      2.340
..                            ...      ...        ...
604 2009-06-30 23:59:59.999999999     infl      3.370
605 2009-06-30 23:59:59.999999999    unemp      9.200
606 2009-09-30 23:59:59.999999999  realgdp  12990.341
607 2009-09-30 23:59:59.999999999     infl      3.560
608 2009-09-30 23:59:59.999999999    unemp      9.600

[609 rows x 3 columns]

In [112]:
pivoted = ldata.pivot('date','item','value')
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

In [113]:
ldata['value2'] = np.random.randn(len(ldata))
pivoted = ldata.pivot('date','item')
pivoted

# pivot é equivalente à criação de um índice hierárquico com set_index e unstack
unstacked = ldata.set_index(['date','item']).unstack('item')
unstacked

                              value                     value2            \
item                           infl    realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00   2710.349   5.8  0.236831 -1.781467
1959-06-30 23:59:59.999999999  2.34   2778.801   5.1  1.154856 -0.393011
1959-09-30 23:59:59.999999999  2.74   2775.488   5.3 -0.247849 -1.942324
1959-12-31 23:59:59.999999999  0.27   2785.204   5.6 -0.006445  0.502899
1960-03-31 23:59:59.999999999  2.31   2847.699   5.2 -0.459022  0.796032
...                             ...        ...   ...       ...       ...
2008-09-30 23:59:59.999999999 -3.16  13324.600   6.0 -0.136452 -0.645544
2008-12-31 23:59:59.999999999 -8.79  13141.920   6.9 -0.833826 -0.009965
2009-03-31 23:59:59.999999999  0.94  12925.410   8.1 -1.450894 -1.772770
2009-06-30 23:59:59.999999999  3.37  12901.504   9.2 -0.407552 -1.028170
2009-09-30 23:59:59.999999999  3.56  12990.341   9.6 -0.211745  0.576038


item                              unemp
date
1959-03-31 23:59:59.999999999  0.426637
1959-06-30 23:59:59.999999999 -1.349170
1959-09-30 23:59:59.999999999 -0.335116
1959-12-31 23:59:59.999999999  0.344771
1960-03-31 23:59:59.999999999  1.632247
...                                 ...
2008-09-30 23:59:59.999999999 -0.559196
2008-12-31 23:59:59.999999999 -0.964826
2009-03-31 23:59:59.999999999  0.990450
2009-06-30 23:59:59.999999999 -0.119320
2009-09-30 23:59:59.999999999 -0.249789

[203 rows x 6 columns]

                              value                     value2            \
item                           infl    realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00   2710.349   5.8  0.236831 -1.781467
1959-06-30 23:59:59.999999999  2.34   2778.801   5.1  1.154856 -0.393011
1959-09-30 23:59:59.999999999  2.74   2775.488   5.3 -0.247849 -1.942324
1959-12-31 23:59:59.999999999  0.27   2785.204   5.6 -0.006445  0.502899
1960-03-31 23:59:59.999999999  2.31   2847.699   5.2 -0.459022  0.796032
...                             ...        ...   ...       ...       ...
2008-09-30 23:59:59.999999999 -3.16  13324.600   6.0 -0.136452 -0.645544
2008-12-31 23:59:59.999999999 -8.79  13141.920   6.9 -0.833826 -0.009965
2009-03-31 23:59:59.999999999  0.94  12925.410   8.1 -1.450894 -1.772770
2009-06-30 23:59:59.999999999  3.37  12901.504   9.2 -0.407552 -1.028170
2009-09-30 23:59:59.999999999  3.56  12990.341   9.6 -0.211745  0.576038


item                              unemp
date
1959-03-31 23:59:59.999999999  0.426637
1959-06-30 23:59:59.999999999 -1.349170
1959-09-30 23:59:59.999999999 -0.335116
1959-12-31 23:59:59.999999999  0.344771
1960-03-31 23:59:59.999999999  1.632247
...                                 ...
2008-09-30 23:59:59.999999999 -0.559196
2008-12-31 23:59:59.999999999 -0.964826
2009-03-31 23:59:59.999999999  0.990450
2009-06-30 23:59:59.999999999 -0.119320
2009-09-30 23:59:59.999999999 -0.249789

[203 rows x 6 columns]

### Pivotamento de largo para longo
<br>
A função pd.melt() faz um merge de várias colunas em uma só.

In [114]:
df = pd.DataFrame({'key':['foo','bar','baz'], 'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [115]:
melted = pd.melt(df, ['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [116]:
# pd.pivot() é a função inversa de pd.melt()
reshaped = melted.pivot('key','variable','value')
reshaped
print('-----------------------')
reshaped.reset_index()
print('-----------------------')

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

-----------------------

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

-----------------------

In [117]:
# podemos especificar quais colunas serão usadas como coluna de valor e coluna de índice
pd.melt(df, id_vars=['key'], value_vars=['A','B'])
print('-----------------------')
pd.melt(df, value_vars=['A','B','C'])
print('-----------------------')
pd.melt(df, value_vars=['key','A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

-----------------------

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

-----------------------

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6